Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_pwm.h
/**************************************************************************//**
 * @file     rtl8195bhp_pwm.h
 * @brief    The HAL related definition and macros for the PWM device.
 *           Includes Registers and data type definition.
 * @version  V1.00
 * @date     2016-07-22
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735B_PWM_H_
#define _RTL8735B_PWM_H_

#ifdef  __cplusplus
extern "C"
{
#endif

#include "rtl8735b_timer.h"
#include "rtl8735b_pwm_comm_type.h"
#include "rtl8735b_pwm_type.h"


/**
 * @addtogroup hs_hal_pwm PWM
 * @{
 */

/**
  * \brief define PWM ID
**/
enum  pwm_id_e {
	Pwm0           = 0, //!< PWM0
	Pwm1           = 1, //!< PWM1
	Pwm2           = 2, //!< PWM2
	Pwm3           = 3, //!< PWM3
	Pwm4           = 4, //!< PWM4
	pwm5           = 5, //!< PWM5
	pwm6           = 6, //!< PWM6
	pwm7           = 7, //!< PWM7
	Pwm8           = 8, //!< PWM4
	pwm9           = 9, //!< PWM5
	pwm10          = 10, //!< PWM6
	pwm11          = 11, //!< PWM7

	MaxPwmNum      = 12  //!< MAX_PWM_NUM
};
typedef uint8_t pwm_id_t;

#define Pro2 1


/**
  * \brief define PWM Limit Interrupt direction
**/
enum  pwm_limit_dir_e {
	PwmDownLimitInt      = 0,   //!< Interrupt triggered by duty ratio = down limit
	PwmUpLimitInt        = 1    //!< Interrupt triggered by duty ratio = up limit
};
typedef uint8_t pwm_limit_dir_t;

/**
  * \brief define PWM tick source selection, as the PWM control register definition
**/
enum  pwm_clk_sel_e {
	PwmClkSrc_Tm0       = GTimer0,    //!< Tick source from G-Timer 8
	PwmClkSrc_Tm1       = GTimer1,    //!< Tick source from G-Timer 9
	PwmClkSrc_Tm2      = GTimer2,   //!< Tick source from G-Timer 10
	PwmClkSrc_Tm3      = GTimer3,   //!< Tick source from G-Timer 11
	PwmClkSrc_Tm4      = GTimer4,   //!< Tick source from G-Timer 12
	PwmClkSrc_Tm5      = GTimer5,   //!< Tick source from G-Timer 13
	PwmClkSrc_Tm6      = GTimer6,   //!< Tick source from G-Timer 14
	PwmClkSrc_Tm7      = GTimer7,   //!< Tick source from G-Timer 15
	PwmClkSrc_SClk      = 16,         //!< Tick source from SCLK

	PwmClkSrc_None      = 0xFF //!< Not assign yet
};
typedef uint8_t pwm_clk_sel_t;

/**
  * \brief define PWM duty auto-adjustment direction
**/
enum  pwm_duty_adj_dir_e {
	PwmDutyAdj_Decrease     = 0,        //!< Increase the duty
	PwmDutyAdj_Increase     = 1         //!< decrease the duty
};
typedef uint8_t pwm_duty_adj_dir_t;

/**
  * \brief define PWM Interrupt ID
**/
enum  pwm_adj_int_e {
	PwmAdjIntDnLim = 1, //!< Interrupt ID = down limit
	PwmAdjIntUpLim = 2, //!< Interrupt ID = up limit
};

/**
  * \brief define PWM Duty Auto-Adjustment loop mode
**/
enum  pwm_duty_loop_mode_e {
	PwmDutyLoopOff = 0,     //!< Interrupt loop mode = loop off
	PwmDutyLoopCnt = 1,     //!< Interrupt ID = loop cnt
	PwmDutyLoopForever = 2  //!< Interrupt ID = loop forever
};

/**
  * \brief define PWM Interrupt clock source
**/
enum  pwm_int_clk_e {
	PWM_IntClk_APB      = 0,    //!< APB
	PWM_IntClk_32K      = 1     //!< 32k
};
typedef uint8_t pwm_int_clk_t;

#define PWM_CURRENT_DUTY            0xFFFFFFFF
//#define UNIFY_PWM 1
#define PWM_Sclk_32k 0
#define PWM_Sclk_4M  1
#define PWM_Sclk_40M 2



/*! define PWM interrupt call back function */
typedef void (*pwm_lim_callback_t)(void *, pwm_limit_dir_t dir);
typedef void (*pwm_lo_callback_t)(void *);
typedef void (*pwm_period_callback_t)(void *);

/**
  * \brief  The data structure to control the PWM duty auto adjstment.
*/
typedef struct hal_pwm_auto_duty_adj_s {
	u32 init_duty_us;   /*!< The initial duty size of the PWM to start a duty auto-adjustment, in us */
	u32 max_duty_us;   /*!< The maximum duty size of the duty auto-adjustment, in us */
	u32 min_duty_us;   /*!< The minium duty size of the duty auto-adjustment, in us */
	u32 duty_inc_step_us;   /*!< The step size for the duty auto-adjustment increasing, in us */
	u32 duty_dec_step_us;   /*!< The step size for the duty auto-adjustment decreasing, in us */
	u32 step_period_cnt;   /*!< The number of PWM period to perform a duty auto-adjustment */
	u8 init_dir;    /*!< The initial duty auto-adjustment direction */
	u8 loop_mode;   /*!< Is enable the duty auto-adjustment loop mode */
} hal_pwm_auto_duty_adj_t, *phal_pwm_auto_duty_adj_t;

/**
  * \brief  The data structure to handle a PWM device, it includes the configuration, register base address
          and interrupt call back functions.
*/
typedef struct hal_pwm_adapter_s {
	PWM_TypeDef *base_addr;      /*!< The PWM registers base address */
	pwm_id_t pwm_id;   /*! The PWM device index, 0 ~ 11 */
	u8 pin_sel;  /*! IO pin selection for this PWM */
	pwm_clk_sel_t pwm_clk_sel;  /*! The PWM tick source selection, 0 ~ 8 */
	u8 adj_int_en;       /*! The duty ratio auto adjustment interrupt enable control */
	u16 duty_res_us;     /*! minimum resolution for the PWM duty, in us */
	u32 adj_loop_count;    /*! The duty ratio auto adjustment loop count */
	u32 tick_p5us;    /*! The tick time of this PWM, the unit of tick time is 0.5us */
	u32 period_us;    /*! The period time of current PWM cycle, in us */
	u32 duty_us;      /*! The duty time of current PWM cycle, in us */
	hal_pwm_auto_duty_adj_t duty_adj; /*! The data structure to control the PWM duty auto adjstment. */

	pwm_lim_callback_t bound_callback;      /*! User callback function for duty ratio reachs the boundary limit */
	void *bound_cb_para;   /*! the argument for user duty size reachs the limit callback function */
	pwm_lo_callback_t loopout_callback;      /*! User callback function for duty ratio auto adjustment loop count down to 0 */
	void *lo_cb_para;   /*! the argument for duty auto-adj loopout callback function */
	pwm_period_callback_t period_callback;      /*! User callback function for PWM period time end */
	void *pe_cb_para;   /*! the argument for PWM period end callback function */
	void (*enter_critical)(void);   /*! the function for entering timer critical state */
	void (*exit_critical)(void);    /*! the function for exit timer critical state */
	hal_gdma_adaptor_t *ptx_gdma;           /*!< The GDMA channel handler for the PWM TX */
	hal_gdma_adaptor_t *prx_gdma;           /*!< The GDMA channel handler for the PWM RX */
	void (*dcache_invalidate_by_addr)(uint32_t *addr, int32_t dsize);   /*!< callback function to do the D-cache invalidate  */
	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);        /*!< callback function to do the D-cache clean  */
	uint32_t reserved[7];
} hal_pwm_adapter_t, *phal_pwm_adapter_t;

/**
  \brief  The data structure to handle PWM devices common part, includes the base address of common registers
          and PWM adapters for interrupt process.
*/
typedef struct hal_pwm_comm_adapter_s {
	PWM_COMM_TypeDef *base_addr;      /*!< The PWM common register base address */
	hal_pwm_adapter_t *pwm_adapter[MaxPwmNum];   /*!< All the PWM adapters share the same interrupt IRQ */
	uint8_t *timer_list;    /*!< the list of avaliable timer as the PWM tick source, keep NULL for no assign */
	uint32_t reserved[10];
} hal_pwm_comm_adapter_t, *phal_pwm_comm_adapter_t;

/**
  \brief  The data structure of the stubs function for the PWM HAL functions in ROM
*/
typedef struct hal_pwm_func_stubs_s {
	phal_pwm_comm_adapter_t *pppwm_comm_adp;
	//io_pin_t *pwm_pin_table;
	u32 *pwm_pin_table;
	void (*hal_pwm_irq_handler)(void);
	void (*hal_pwm_comm_irq_reg)(irq_handler_t irq_handler);
	void (*hal_pwm_comm_irq_unreg)(void);
	void (*hal_pwm_comm_init)(hal_pwm_comm_adapter_t *ppwm_com_adp);
	void (*hal_pwm_comm_deinit)(void);
	void (*hal_pwm_comm_tick_source_list)(uint8_t *timer_list);
	hal_status_t (*hal_pwm_init)(hal_pwm_adapter_t *ppwm_adp, u8 pwm_id, u8 pin_sel, u16 duty_res_us);

