Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_pwm.h
	BOOLEAN(*hal_pwm_enable_sts)(hal_pwm_adapter_t *ppwm_adp);
	void (*hal_pwm_comm_enable)(u32 en_ctrl);
	void (*hal_pwm_comm_disable)(u32 dis_ctrl);
	void (*hal_pwm_enable)(hal_pwm_adapter_t *ppwm_adp);
	void (*hal_pwm_disable)(hal_pwm_adapter_t *ppwm_adp);
	void (*hal_pwm_deinit)(hal_pwm_adapter_t *ppwm_adp);
	void (*hal_pwm_set_clk_sel)(hal_pwm_adapter_t *ppwm_adp, pwm_clk_sel_t clk_sel);
	void (*hal_pwm_wait_ctrl_ready)(hal_pwm_adapter_t *ppwm_adp);
	hal_status_t (*hal_pwm_set_tick_time)(hal_pwm_adapter_t *ppwm_adp, u32 tick_p5us);
	hal_status_t (*hal_pwm_set_duty)(hal_pwm_adapter_t *ppwm_adp, u32 period_us, \
									 u32 duty_us, u32 start_offset_us);
	u32(*hal_pwm_read_duty)(hal_pwm_adapter_t *ppwm_adp);
	void (*hal_pwm_change_duty)(hal_pwm_adapter_t *ppwm_adp, u32 duty_us);
	hal_status_t (*hal_pwm_set_duty_limit)(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us, u32 min_duty_us);
	void (*hal_pwm_set_auto_duty_adj)(hal_pwm_adapter_t *ppwm_adp, hal_pwm_auto_duty_adj_t *pauto_duty);
	void (*hal_pwm_auto_duty_en)(hal_pwm_adapter_t *ppwm_adp, BOOLEAN enable);
	hal_status_t (*hal_pwm_set_auto_duty_inc)(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us, \
			u32 step_sz_us, u32 step_period_cnt);
	hal_status_t (*hal_pwm_set_auto_duty_dec)(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_us, \
			u32 step_sz_us, u32 step_period_cnt);
	hal_status_t (*hal_pwm_set_auto_duty_loop)(hal_pwm_adapter_t *ppwm_adp, u8 ini_dir, u32 loop_cnt);
	void (*hal_pwm_set_period_int)(hal_pwm_adapter_t *ppwm_adp, pwm_period_callback_t callback, void *arg, u8 int_en);
	void (*hal_pwm_set_autoadj_int)(hal_pwm_adapter_t *ppwm_adp, pwm_lim_callback_t callback, void *arg, u8 int_en);
	void (*hal_pwm_set_autoadj_loop_int)(hal_pwm_adapter_t *ppwm_adp, pwm_lo_callback_t callback, void *arg);
	hal_status_t (*hal_pwm_auto_duty_inc)(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_us, u32 step_sz_us, \
										  u32 step_period_cnt);
	hal_status_t (*hal_pwm_auto_duty_dec)(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_us, \
										  u32 step_sz_us, u32 step_period_cnt);
	hal_status_t (*hal_pwm_auto_duty_loop)(hal_pwm_adapter_t *ppwm_adp, u32 ini_duty_us, u8 ini_dir, u32 loop_cnt);
	void (*hal_pwm_stop_duty_loop)(hal_pwm_adapter_t *ppwm_adp, u8 stop_now);
	hal_status_t (*hal_pwm_set_duty_ns)(hal_pwm_adapter_t *ppwm_adp, u32 period_ns, u32 duty_ns, u32 start_offset_ns);
	hal_status_t (*hal_pwm_auto_duty_ns_inc)(hal_pwm_adapter_t *ppwm_adp, u32 max_duty_ns, u32 step_sz_ns, u32 step_period_cnt);
	hal_status_t (*hal_pwm_auto_duty_ns_dec)(hal_pwm_adapter_t *ppwm_adp, u32 min_duty_ns, u32 step_sz_ns, u32 step_period_cnt);
	u32(*hal_pwm_read_duty_ns)(hal_pwm_adapter_t *ppwm_adp);
	hal_status_t (*hal_pwm_dma_init)(hal_pwm_adapter_t *ppwm_adp, phal_gdma_adaptor_t pgdma_chnl, int mode);
	hal_status_t (*hal_pwm_dma_send)(hal_pwm_adapter_t *ppwm_adp, uint8_t *ptx_buf, uint32_t len);
	hal_status_t (*hal_pwm_cache)(phal_pwm_adapter_t ppwm_adp, void *dcache_clean_function, void *dcache_invalidate_function);
	void (*hal_pwm_clk_sel)(int Sclk);
	void (*hal_pwm_clock_init)(int en);
	hal_status_t (*hal_pwm_complementary)(phal_pwm_adapter_t ppwm_adp, uint8_t group, uint8_t DB_value, bool en);
	uint32_t reserved[7];  // reserved space for next ROM code version function table extending.
} hal_pwm_func_stubs_t;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_pwm_rom_func PWM HAL ROM APIs.
 * @{
 */

/**
 *  \brief To read the PWM devives enable status
 *
 *  \param[in] ppwm_com_adp The PWM devices common adapter.
 *
 *  \returns The PWM devices enable status, bit 0 ~ 11 map to PWM0 ~ PWM11.
 */
__STATIC_INLINE
u32 hal_rtl_pwm_comm_enable_sts(hal_pwm_comm_adapter_t *ppwm_com_adp)
{
	PWM_COMM_TypeDef *PWM_COMM_OBJ = (PWM_COMM_TypeDef *)(ppwm_com_adp->base_addr);
	return PWM_COMM_OBJ->PWM_COMM_ENABLE_STATUS;
}

/**
 *  \brief To update a new PWM timing setting to HW register.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_update_ctrl(hal_pwm_adapter_t *ppwm_adp)
{
	// assert the ctrl_set bit to trigger the HW to fetch the new setting,
	// HW will clear this ctrl_set bit when the update is done
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	PWM_OBJ->PWM_CTRL = PWM_OBJ->PWM_CTRL | PWM_BIT_CTRL_SET;

}

/**
 *  \brief To set the period time of the PWM on duty.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] duty_ticks The number of ticks: the time period of the on duty.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_set_duty_size(hal_pwm_adapter_t *ppwm_adp, u32 duty_ticks)
{
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 DUTY;
	DUTY = duty_ticks & PWM_MASK_DUTY;
	PWM_OBJ->PWM_CTRL = PWM_OBJ->PWM_CTRL & (~PWM_MASK_DUTY);
	PWM_OBJ->PWM_CTRL = PWM_OBJ->PWM_CTRL | DUTY;
}

/**
 *  \brief To set the start offset of the PWM on duty.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] start_ticks The on duty start offset time, in ticks.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_set_onduty_start(hal_pwm_adapter_t *ppwm_adp, u32 start_ticks)
{
	//start_ticks = 0x7cf;
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 duty_start;
	duty_start = 0;
	duty_start = (start_ticks << 16) & PWM_MASK_DUTY_START;
	PWM_OBJ->PWM_TIMING_CTRL = PWM_OBJ->PWM_TIMING_CTRL & (~PWM_MASK_DUTY_START);
	PWM_OBJ->PWM_TIMING_CTRL = PWM_OBJ->PWM_TIMING_CTRL | duty_start;
}

/**
 *  \brief To set the period time of a PWM cycle.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] period_ticks The period time of the PWM cycle.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_set_period(hal_pwm_adapter_t *ppwm_adp, u32 period_ticks)
{
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);
	u32 period;
	period = period_ticks & PWM_MASK_PERIOD;
	PWM_OBJ->PWM_TIMING_CTRL = PWM_OBJ->PWM_TIMING_CTRL & (~PWM_MASK_PERIOD);
	PWM_OBJ->PWM_TIMING_CTRL = PWM_OBJ->PWM_TIMING_CTRL | period;
}

/**
 *  \brief To pause a PWM out. When pausing a PWM, the PWM HW will stop at the end of
 *         current period.
 *
 *  \param[in] ppwm_adp The PWM device adapter.
 *  \param[in] pause_ctrl The pause control, 0: un-pause the PWM, 1: pause the PWM.
 *
 *  \returns void
 */
__STATIC_INLINE
void hal_rtl_pwm_pause(hal_pwm_adapter_t *ppwm_adp, BOOL pause_ctrl)
{
	PWM_TypeDef *PWM_OBJ = (PWM_TypeDef *)(ppwm_adp->base_addr);

